{
  "posts": {
    "technical-ai-landscape": {
      "id": "27b79889-bbb1-815d-9432-ec68ae21dac5",
      "title": "Technical AI Landscape",
      "status": "Published",
      "published_date": "2025-09-27",
      "blog_type": "Personal",
      "url": "https://www.notion.so/Technical-AI-Landscape-27b79889bbb1815d9432ec68ae21dac5",
      "content": "<p>Software has become the primary engine of economic growth. While immediately true in digital environments, it's also become a critical part of physical systems: GPUs/CPUs, supply chains, agriculture, and health—making software developers essential to capturing economic value in the 21st century. The exponential growth of AI adoption and utilization are testimonies of this and highlights the need to elevate the software development globally. The most efficient, impactful path to achieving this is through widespread, effective AI utilization among developers. Last week, however, Anthropic's <a href=\"https://www.anthropic.com/research/anthropic-economic-index-september-2025-report\" target=\"_blank\" rel=\"noopener noreferrer\">Economic Index Report</a> showed us that effective AI integration is not as widespread or evenly distributed across the world:</p><img src=\"images/27b79889-bbb1-80b8-8c65-fd1bbaf906cd.png\" alt=\"\" /><p>Their analysis shows varying levels of “AI maturity” across countries, suggesting individuals in wealthy countries are more likely to effectively integrate Claude (AI tools by proxy) into their workflows than individuals in less wealthy countries. This insight, alongside the publication of the underlying data, drove me to dig into the numbers myself and zoom in on regional variations (specifically around software development tasks) across human-AI collaboration, request complexity, and usage efficiency—painting a picture of how technical AI integration differs across regions globally.</p><h2>Approach</h2><p>Claude data is strongly positioned to analyze the state of software development, because the time period the dataset covers is the period when it was the preferred AI platform for coding—which has recently shifted towards GPT-5. The dataset offers insight into country-level variations across request types by complexity levels, collaboration patterns, and usage for occupational tasks. At the global level, the API data shares indices on the prompt and completion length for various tasks, alongside cost indices to execute those tasks.\nThe goal of this analysis is to provide directional insights into the regional variance of technical AI adoption, so my work aggregates Anthropic's country-level data into 5 regions: APAC, Europe, Latin America, Middle East & Africa, and North America. The data informed three complementary regional analyses:</p><ul><li><strong>Request Complexity</strong>: Distribution of software development requests by complexity levels across regions (how complex are the technical tasks users assign in each region?)</li><li><strong>Human-AI Collaboration Patterns</strong>: Distribution of regional tasks that automate versus augment work (do users in each region primarily use Claude to augment their capabilities or automate their tasks?)</li><li><strong>Token Efficiency Measurement</strong>: Regional prompt, task completion, and cost token indices for software development tasks (how much does each region consume when using AI for technical tasks?)</li></ul><p>This analysis reveals patterns in AI adoption across regions, enabling a combined metric that captures both task efficiency and interaction quality—a Technical AI Maturity Score. You can review the methodology and work on <a href=\"https://github.com/rodriguezjordyc/claudeanalysis\" target=\"_blank\" rel=\"noopener noreferrer\">Github</a>.</p><p>Why does measuring something like this matter? Because software development drives economic growth—both for entire countries and individual people. Individuals are using Replit, Vercel, and Lovable to build businesses that make real money. Development teams are shipping products faster than ever with support from agentic ecosystems like Cursor, Factory, and Codex.</p><p>There are, of course, limitations in the data and methodology, as well as economic and social factors that influence regional outcomes (see Appendix A). Anthropic's report shares an objective view of AI diffusion globally but abstains from filling in the blanks on its implications. These results hopefully catalyze conversations that fill in those blanks.</p><p>Understanding how well different regions use AI for coding tells us who's best positioned to capture the economic benefits AI creates. The AI Maturity Score isn't perfect—there's way more to the story—but it gives us a starting point to understand regional positioning.</p><h2>Results</h2><h3>Human-AI Collaboration</h3><p>The collaboration data shows some clear regional differences in how people work with AI:</p><img src=\"images/27b79889-bbb1-804e-9d55-f8baf68172d3.png\" alt=\"\" /><img src=\"images/27b79889-bbb1-804b-bc46-cdda70f7c91b.png\" alt=\"\" /><ul><li>Latin America and Middle East & Africa show a preference for automation-leaning collaboration styles (directive + feedback loop)</li><li>North America, Europe, and APAC show a preference for augmentation-leaning collaboration styles (task iteration + learning + validation)</li></ul><h3>Request Complexity</h3><p>Request complexity data shows big differences in the kinds of problems developers solve with AI:</p><img src=\"images/27b79889-bbb1-8042-9441-cba49bf4ad98.png\" alt=\"\" /><ul><li>North America and APAC use AI for high complexity technical tasks the most</li><li>Europe, Latin America, and Middle East & Africa use AI for low complexity technical tasks the most</li></ul><img src=\"images/27b79889-bbb1-80fb-9e33-fda2cd3c9718.png\" alt=\"\" /><p>Additionally, when mapping technical requests to different stages of the software development lifecycle, APAC and Middle East & Africa rely more heavily on AI during the testing and QA stages, whereas Europe, Latin America, and North America rely more heavily on AI during the implementation and coding stages</p><h3>Token Efficiency</h3><p>Token and cost indices data shows us who's efficiently managing usage costs during AI interactions:</p><img src=\"images/27b79889-bbb1-80a4-a401-c92858c4595d.png\" alt=\"\" /><ul><li>Latin America and Middle East & Africa's token index when prompting technical tasks is higher than other regions' token indices</li><li>Latin America and Middle East & Africa's token index for the completion of technical tasks is also higher than other regions' token indices</li><li>Latin America and Middle East & Africa's cost index for technical tasks is higher than other regions' cost index</li></ul><h3>Technical AI Maturity Score</h3><p>The Technical AI Maturity Score combines all three factors into one metric:</p><img src=\"images/27b79889-bbb1-8021-9619-c5ad7483967a.png\" alt=\"\" /><ul><li>North America leads in technical AI maturity, followed by Europe and APAC</li><li>Latin America and Middle East & Africa rank the lowest in technical AI maturity</li></ul><img src=\"images/27b79889-bbb1-8055-bdd9-fd26d00dd9ff.png\" alt=\"\" /><p>This metric rewards regions that use AI to augment developers' capabilities, tackle hard problems, and do it efficiently—giving us a better picture than each component independently.</p><h2>Three Dimensions of Technical AI Integration</h2><p>The analysis focuses on understanding <em>how</em> regions use AI for coding, less on <em>how much</em> they use it. This uncovered three distinct patterns across regions: how they collaborate with AI, what complexity problems they tackle, and how efficiently they use resources.</p><h3>Collaboration Philosophy</h3><table data-has-column-header=\"true\"><thead><tr><th><strong>Automation-Seeking</strong></th><th><strong>Augmentation-seeking</strong></th></tr></thead><tbody><tr><td data-label=\"<strong>Automation-Seeking</strong>\">AI as an advanced tool</td><td data-label=\"<strong>Augmentation-seeking</strong>\">AI as a thinking partner</td></tr><tr><td data-label=\"<strong>Automation-Seeking</strong>\">Directive + Feedback patterns</td><td data-label=\"<strong>Augmentation-seeking</strong>\">Iteration + Learning + Validation patterns</td></tr></tbody></table><p><em>Implication</em>: Augmentation scales human capability; automation replaces human effort</p><h3>Complexity Engagement</h3><table data-has-column-header=\"true\"><thead><tr><th><strong>Complexity-avoidant</strong></th><th><strong>Complexity-embracing</strong></th></tr></thead><tbody><tr><td data-label=\"<strong>Complexity-avoidant</strong>\">High usage of AI for simple tasks</td><td data-label=\"<strong>Complexity-embracing</strong>\">High usage of AI for complex tasks</td></tr><tr><td data-label=\"<strong>Complexity-avoidant</strong>\">Level 2 tasks</td><td data-label=\"<strong>Complexity-embracing</strong>\">Level 0 tasks</td></tr></tbody></table><p><em>Implication</em>: Complex technical work generates higher economic value</p><h3>Resource Efficiency</h3><table data-has-column-header=\"true\"><thead><tr><th><strong>Token-intensive</strong></th><th><strong>Token-efficient</strong></th></tr></thead><tbody><tr><td data-label=\"<strong>Token-intensive</strong>\">Higher prompt, completion, cost indices</td><td data-label=\"<strong>Token-efficient</strong>\">Lower prompt, completion, cost indices</td></tr><tr><td data-label=\"<strong>Token-intensive</strong>\">Higher costs</td><td data-label=\"<strong>Token-efficient</strong>\">Efficient resource utilization</td></tr></tbody></table><p><em>Implication</em>: Efficiency determines scalability and sustainable competitive advantage</p><h2>Regional AI Maturity Archetypes</h2><p>Evaluating regions across these dimensions creates three distinct profiles: sophistication leaders, balanced adopters, and automation seekers.</p><table data-has-column-header=\"true\" data-has-row-header=\"true\"><thead><tr><th></th><th>Collaboration</th><th>Efficiency</th><th>Complexity</th><th>Regions</th></tr></thead><tbody><tr><th><strong>Sophistication Leaders</strong></th><td data-label=\"Collaboration\">High Augmentation</td><td data-label=\"Efficiency\">High</td><td data-label=\"Complexity\">High</td><td data-label=\"Regions\">North America</td></tr><tr><th><strong>Balanced Adopters</strong></th><td data-label=\"Collaboration\">Moderate Augmentation</td><td data-label=\"Efficiency\">Variable</td><td data-label=\"Complexity\">Moderate</td><td data-label=\"Regions\">Europe, APAC</td></tr><tr><th><strong>Automation Seekers</strong></th><td data-label=\"Collaboration\">High Automation</td><td data-label=\"Efficiency\">Low</td><td data-label=\"Complexity\">Low</td><td data-label=\"Regions\">Latin America, Middle East & Africa</td></tr></tbody></table><p>Sophistication Leaders are leveraging AI as a strategic partner to solve complex technical problems, building advantages that are difficult to replicate for other regions. Balanced Adopters are creating steady value but have a lot of room to grow. Automation seekers are focused on automating simple tasks at high costs and perceived lower trust in AI for complex tasks.</p><h2>Strategic Growth Opportunities</h2><p>Regional profiles intend to draw different paths towards economic success in an increasingly AI-native world. The interpretations of these patterns depends on your role in the ecosystem, but they show clear risks and opportunities for anyone who wants AI's benefits fairly distributed globally.</p><h3>Mature Regions: APAC, Europe, North America</h3><table data-has-column-header=\"true\"><thead><tr><th>Risk</th><th>Sophistication plateau as technical AI adoption expands (which can also be a positive signal)</th></tr></thead><tbody><tr><td data-label=\"Risk\">Opportunity</td><td data-label=\"Sophistication plateau as technical AI adoption expands (which can also be a positive signal)\">Lead next-gen AI-native development methodologies</td></tr><tr><td data-label=\"Risk\">Strategic Focus</td><td data-label=\"Sophistication plateau as technical AI adoption expands (which can also be a positive signal)\">Pioneer Human-AI collaboration standards, export expertise</td></tr></tbody></table><h3>Emerging Regions: Latin America, Middle East & Africa</h3><table data-has-column-header=\"true\"><thead><tr><th>Risk</th><th>Efficiency gap may compound into permanent economic disadvantage</th></tr></thead><tbody><tr><td data-label=\"Risk\">Opportunity</td><td data-label=\"Efficiency gap may compound into permanent economic disadvantage\">Leapfrog traditional adoption curves with sophistication-first strategies</td></tr><tr><td data-label=\"Risk\">Strategic Focus</td><td data-label=\"Efficiency gap may compound into permanent economic disadvantage\">Targeted complexity engagement training</td></tr></tbody></table><h3>For AI Companies</h3><p><em>Go-to-market</em></p><p>The regional archetypes suggest AI companies face fundamentally different growth challenges than traditional SaaS. Sophistication Leaders like North America reward premium positioning around complex collaboration, while Automation Seekers in Latin America and MEA may require educational investment and trust building before monetization. Companies winning in mature markets through PLG or cracked sales organizations doesn't guarantee similar traction in emerging regions without adapting to local complexity preferences and efficiency constraints—traditional playbooks break down when users' motivations to leverage AI change.</p><p><em>Cultural Connection</em></p><p>SDLC task distribution reveals deeper cultural differences than language localization. APAC's testing/QA focus, for example, suggests AI companies need region-specific feature prioritization, not just translation. The collaboration patterns also indicate that community engagement strategies successful in augmentation-seeking regions may alienate automation-seeking users. Growth velocity depends on understanding these cultural collaboration preferences rather than assuming universal developer needs.</p><p><em>Strategic Positioning</em></p><p>The efficiency gap in emerging regions creates both risk and opportunity for AI startups. Companies that help Automation Seekers transition to complexity-embracing behaviors could develop strong, local partnerships, but those reinforcing the “automation trap” risk limiting long-term market potential. There is a tradeoff between optimizing for viral adoption in emerging regions or investing in elevating regional AI maturity—a strategic choice that determines sustainable competitive advantage versus short-term growth.</p><h2>Appendix A</h2><p>Potential confounders in results (non-exhaustive)</p><table data-has-row-header=\"true\"><tbody><tr><th>Adoption Stage</th><td>adoption curve position</td></tr><tr><th>Economic Access</th><td>pricing power, enterprises' and individuals' budget allocation vary</td></tr><tr><th>Infrastructure Bottlenecks</th><td>internet and device capabilities shape usage</td></tr><tr><th>Cultural-Professional Limitations</th><td>varying risk tolerance levels for tool experimentation, regions with different documentation traditions may appear less “token efficient”</td></tr><tr><th>Sample Size and Composition</th><td>unknown developer vs non-developer share using Claude for technical tasks, different sector concentration across regions</td></tr><tr><th>Competitive Landscape</th><td>preferred alternative AI tools, regional integration requirements for ecosystem (IDEs, tool, local infra)</td></tr></tbody></table>",
      "excerpt": "Sep 27, 2025"
    },
    "quick-thoughts-on-ai-supply-chain": {
      "id": "26379889-bbb1-8042-9da5-d5e5d0c4ade7",
      "title": "Quick Thoughts on AI Supply Chain",
      "status": "Published",
      "published_date": "2025-09-02",
      "blog_type": "Personal",
      "url": "https://www.notion.so/Quick-Thoughts-on-AI-Supply-Chain-26379889bbb180429da5d5e5d0c4ade7",
      "content": "<p><em>I wrote this analysis last year while trying to understand the AI supply chain. Publicly sharing notes I wrote for myself below:</em></p><hr><p>I've been trying to understand the supply chain that enables the commercial deployment of AI systems. The growing interest in AI from enterprises and consumers has been catalyzed by GenAI models from a select number of companies: OpenAI, Anthropic, Google, Meta, Microsoft.</p><p>The rapid growth of AI adoption has mainly been centered around the suppliers of foundational models (e.g. GPT-4) and firms building domain-specific applications powered by foundational models (e.g. chatbots, virtual assistants). However, this overlooks the various stakeholders within the supply chain that help train, fine-tune, integrate, deploy, and manage AI systems for the best end-user experience. The current state of AI deployment is reminiscent of the early days in IT services outsourcing.</p><p><strong>Opportunity for Latin America</strong></p><p>Given the existing growth of LLMs and adjacent foundational models is a result of decades of R&D from major U.S. and Chinese companies and universities, there is an opportunity for Latin America to build companies that enable and manage the efficient deployment of AI systems for enterprises in the region and globally.</p><p>Below is a quick categorization of different areas in the supply chain from upstream to downstream stages of AI development and deployment (this is the first attempt at organizing different literature, so it is subject to change). There is a unique space for domain-focused AI startups and AI infrastructure startups to create AI tools / services that are tailored to Latin American business practices and contextual consumer preferences. Additionally, there will soon be an interest in managing non-modular AI services and measuring the efficacy of systems.</p><hr><p><strong>AI Supply Chain Categories (Upstream to Downstream)</strong></p><table data-has-row-header=\"true\"><tbody><tr><th>Data Providers</th><td>Companies collecting, aggregating, labelling, and selling data for model training</td></tr><tr><th>Foundational Model Creators</th><td>Companies building and licensing proprietary AI / ML models (domain agnostic)</td></tr><tr><th>Domain-focused App Developers</th><td>Companies fine-tuning foundational models and applications for enterprise or consumer use-cases</td></tr><tr><th>AI Infra Providers</th><td>Companies facilitating the deployment & management of AI / ML systems for model creators or enterprises</td></tr><tr><th>End-user</th><td>Enterprises or consumers</td></tr></tbody></table><hr><p><strong>Supply Chain Complexity</strong></p><p>The interactions between stakeholders across the supply chain cannot be easily mapped because they are not as linear as traditional supply chains. For example, End-users, such as enterprises, may directly license from Foundational Model Providers, eliminating Domain-focused Application Developers from the equation. What is certain, however, is the value creation across all levels of the supply chain. Stanford's research on foundational model ecosystems illustrates these complex connections between stakeholders.</p><p><strong>Objective and Scope</strong></p><p>The objective of this quick summary is to help categorize the levels of AI development and deployment, as there is value yet to be unlocked across the supply chain. A follow-up to this is a market map similar to one created by the Madry Lab at MIT for companies in Latin America and a better understanding of the physical infrastructure supply chain that enables AI deployment in the region.</p><p>This view excludes the physical infrastructure necessary for energy-efficient, performance-maximizing deployments: GPUs, semiconductors, data centers, cloud services, fiber / 5G networks, and advanced energy technologies, among others. The physical infrastructure layer represents another massive opportunity, especially as current demand far exceeds supply capacity.</p>",
      "excerpt": "Sep 2, 2025"
    },
    "ai-literacy-divide": {
      "id": "24f79889-bbb1-817f-ba30-d262bd791b8a",
      "title": "AI Literacy Divide",
      "status": "Published",
      "published_date": "2025-08-11",
      "blog_type": "Modern Stewardship",
      "url": "https://www.notion.so/AI-Literacy-Divide-24f79889bbb1817fba30d262bd791b8a",
      "content": "<h2><strong>AI-Generated Divide</strong></h2><p>In college, I worked with professors studying how AI adoption might affect economic disparities between countries—particularly between heavily investing nations like the US and smaller Latin American economies. This research focused on macroeconomic patterns, but watching AI unfold in real time has shifted my attention to similar disparities at the individual level.</p><p>I recently came across a prominent tech investor's tweet about a founder he met who writes 10,000 lines of code daily with AI. What caught my attention wasn't just the number—it was that this person has gotten so comfortable with AI that they're choosing not to hire anyone because they'd rather keep coding than take time for interviews.</p><p>Examples like this illustrate a wider trend among highly technical people who found systematic ways to leverage AI, and less technical people who are still experimenting with AI sporadically. The same dynamics that exist between countries are unfolding between individuals.</p><p>To better understand how this dynamic may unfold, let's simplify AI adoption patterns. While AI adoption exists on a spectrum, for the sake of this discussion, let's focus on two broad groups: purposeful and sporadic. Purposeful adopters are highly literate with these systems; they probably contribute to building these tools and are equipped to effectively integrate AI to optimize their lives. Sporadic adopters are somewhat AI literate; this group is more diverse, ranging from the AI-curious who engage with tools they see in the news to people who randomly throw questions at ChatGPT.</p><p>Given this distinction, it's fair to assume that purposeful adopters are benefiting from the technology the most today. The real-world impact of these benefits is most apparent in technical contexts, but as the rest of the world catches up, the impact of AI literacy will materialize across technical and non-technical fields alike.</p><h2><strong>Long-Term Impact of AI Literacy</strong></h2><p>What makes understanding this disparity unique is the timing. Although ChatGPT's \"AI moment\" was in 2022, we are still in the very early stages of the AI transition. It's too early to define what the \"benefits\" of AI adoption are: time, productivity, money. But given the pace at which this transition is evolving and the glacial pace of tech policy to guide AI deployment, we must discover that for ourselves in our own lives. Otherwise, we risk building towards an undesirable future.</p><p>While sporadic adopters will certainly benefit from AI, those benefits will be negligible compared to the benefits that purposeful adopters enjoy. Behavioral research reveals that small, consistent habits create meaningful changes that build momentum over time. This principle helps us create a mental model to visualize the long-term impact of being purposeful versus sporadic adopters. These tools will likely become more intuitive and accessible over time—as most technologies do—but there's a significant window of opportunity right now. Those who invest in effectively integrating these systems in their lives today are capturing benefits that may take others years to realize, even as the tools themselves improve.</p><img src=\"images/24f79889-bbb1-819d-a96d-e75bace735ba.png\" alt=\"\" /><p>Understanding this opportunity cost is essential for practicing modern stewardship in an AI-enabled world. Kobe Bryant exemplified this systematic approach to skill development. He didn't just practice—he arrived at the gym four hours before games to work on specific drills, spent hours breaking down film to study opponents' habits and weaknesses, and approached basketball like a craft, not just a sport. He systematically moved around the court, making 15-20 shots from each spot before moving on, turning skill development into a methodical process.</p><p>This same systematic approach applies to AI fluency. There's an alternative future—the desirable future state—where sporadic adopters apply this principle to develop systems that help us capitalize on the technology’s benefits.</p><h2><strong>The Desirable Future State</strong></h2><p>I stay away from clickbait content creators who claim to have the best technology stack to improve your life, because our lifestyles, preferences, and objectives are unique. The tools that may help a person who is early in their career look dramatically different from the tools that may help a senior-level executive. The most important connection I can draw between the two is the underlying principles that are necessary for becoming purposeful adopters: learn, experiment, apply, and evaluate the different tools that we use to enhance our lives.</p><p>The AI news cycle and some tools’ technical interfaces discourage exploration, but this framework will help us approach it with humility and curiosity—and hopefully enjoy it.</p><ul><li><strong>Learn</strong>: It has never been easier to get a comprehensive overview of the tools available that may be most relevant to you. A detailed research prompt in Gemini, Claude, or ChatGPT will produce a great starting point. Most apps have free trials to help us get an understanding of their tools' capabilities. This is where AI literacy differs from digital literacy—you're not just learning an interface, you're learning to think alongside a system that adapts to you while you adapt to it.</li><li><strong>Experiment</strong>: The experimentation phase requires the most patience. Depending on the complexity of AI-native tools, it may require unlearning habits from non-AI versions of that tool. The experimentation process helps us visualize how we want to integrate this tool into our daily lives—if at all. There are some tools that you'll discover are interesting but not necessarily useful in your day-to-day. Workflow compatibility matters more than feature sets.</li><li><strong>Apply</strong>: Once you find tools that you click with, it requires active effort to integrate them into your workflows, which may mean changing your habits and practicing using the tools. I write my drafts on Notion, and Claude has strong integrations where it can directly access my Notion page for proofreading. Claude can also read my computer files where I have lots of writing samples for it to learn my writing style and offer tailored suggestions with Claude Code. Sometimes you'll discover unexpected use cases—I never expected Claude Code to be useful for non-technical work, but it transformed how I interact with my computer and execute the writing process. Integrating a new tool is similar to breaking in new shoes.</li><li><strong>Evaluate</strong>: Given the pace of innovation in the space, existing AI systems are getting better and new tools are spawning regularly. This requires frequent evaluation of our technology stack, ensuring we always use the best tools to enhance our workflows. For example, I had to switch from Gemini to Claude when I started writing regularly—I discovered that switching between apps during the writing process created productivity bottlenecks that a more integrated tool, like Claude, could solve. But there's a caveat to tool switching—sometimes, a \"good enough\" tool you use consistently beats a \"perfect\" tool you abandon after two weeks. The goal isn't to have the latest tools; it's to build sustainable practices for consistent use.</li></ul><img src=\"images/24f79889-bbb1-8172-bcab-c6fa1328e7dc.png\" alt=\"\" /><p>This cycle helps make us into purposeful adopters and work towards a future where purposeful and previously sporadic adopters alike capitalize on the benefits it will have across different dimensions of our lives: the desirable future state. This future only becomes a reality if we invest time and energy into finding ways for AI to enhance our lives.</p><img src=\"images/24f79889-bbb1-8108-b322-ce4efa34b639.png\" alt=\"\" /><p>If you feel overwhelmed by where to begin exploring, here are some of my favorite resources:</p><h3><strong>Books</strong></h3><ul><li><strong>Theory:</strong> <a href=\"https://global.oup.com/academic/product/superintelligence-9780199678112?cc=mx&lang=en\" target=\"_blank\" rel=\"noopener noreferrer\">Superintelligence</a> by Nick Bostrom (2014)</li><li><strong>Application:</strong> <a href=\"https://www.penguinrandomhouse.com/books/741805/co-intelligence-by-ethan-mollick/\" target=\"_blank\" rel=\"noopener noreferrer\">Co-intelligence</a> by Ethan Mollick (2024)</li></ul><h3><strong>News / Reviews</strong></h3><ul><li><strong>AI Reviews / Use Cases:</strong> <a href=\"http://every.to/\" target=\"_blank\" rel=\"noopener noreferrer\">every.to</a></li><li><strong>Philosophy and AI: </strong><a href=\"https://open.substack.com/users/179794473-cosmos-institute?utm_source=mentions\" target=\"_blank\" rel=\"noopener noreferrer\">Cosmos Institute</a></li><li><strong>Applied AI: </strong><a href=\"https://open.substack.com/users/846835-ethan-mollick?utm_source=mentions\" target=\"_blank\" rel=\"noopener noreferrer\">Ethan Mollick</a></li></ul><h3><strong>Favorite AI Tools (August 2025)</strong></h3><ul><li><strong>Research / Web Browser: </strong><a href=\"https://www.perplexity.ai/\" target=\"_blank\" rel=\"noopener noreferrer\">Perplexity</a> / <a href=\"https://www.perplexity.ai/comet\" target=\"_blank\" rel=\"noopener noreferrer\">Comet</a></li><li><strong>Everyday Productivity: </strong><a href=\"https://claude.ai/\" target=\"_blank\" rel=\"noopener noreferrer\">Claude</a></li><li><strong>Personal Coding Projects: </strong><a href=\"https://cursor.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Cursor</a> / <a href=\"https://www.anthropic.com/claude-code\" target=\"_blank\" rel=\"noopener noreferrer\">Claude Code</a></li></ul>",
      "excerpt": "Aug 11, 2025"
    },
    "complexity-science-in-football": {
      "id": "24f79889-bbb1-8167-9d57-d604b46d421d",
      "title": "Complexity Science in Football",
      "status": "Published",
      "published_date": "2025-08-03",
      "blog_type": "Personal",
      "url": "https://www.notion.so/Complexity-Science-in-Football-24f79889bbb181679d57d604b46d421d",
      "content": "<p>Supporting Real Madrid was difficult this season for multiple reasons. Among them was the visible dysfunction of the team in the midst of an injury list the length of a CVS receipt. Seeing Madrid’s striker line filled with heavyweights (Jude, Mbappe, Vini, and Rodrygo) trying to play with a limited defense and midfield made me question whether Ancelotti’s management team did the best with what he had or did the best with what he knew. The experience-based approach to football will always matter, but it has become just as important to incorporate quantitative analyses into football in order to maximize the squad’s potential.</p><p>While there is an existing, strong sports analytics market, football has been a relatively slow sport to integrate complex data science methods into teams’ operations given the sports dynamism, love for tradition, and rapid commercialization. While the latter two are just as important to the resistance of “intellectualization”* of the sport, they are out of scope for the ideas I am currently exploring in this reflection.</p><p>Football matches can be better studied through complex science, opening the door for new scientific frameworks to understand and elevate the beautiful game. <a href=\"https://sfi-edu.s3.amazonaws.com/sfi-edu/production/uploads/publication/2016/10/31/summer_fall1987v2n1.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">John Holland</a> - widely accepted as the pioneer of complex adaptive systems - validates CAS through two high-level characteristics: hierarchical organization and building blocks and system-environment interaction. I’d like to perform an exercise to validate football as a complex system by applying Holland’s definition of CAS.</p><ul><li><strong>Hierarchical Organization and Building Blocks</strong><ul><li>A football match can be described as a competitive interaction between two teams. Each team on the pitch is composed of the coaching staff and player squad. The squad is generally is organized with defensive, midfield, and attacking groups, which are composed of individual players.</li></ul></li><li><strong>System-Environment Interaction</strong><ul><li>In a football match, the environment is the pitch, the rulebook, and the referee. During a match, two systems compete with each other by coordinating with their team through a sequence of actions to achieve a payoff.</li><li>Teams and individuals have access to a wide range of regularities in a football match that they can exploit through diverse action sequences, or strategies, to achieve desired outcome(s). In any given game, teams only explore a subset of the infinitely many possibilities.</li><li>Although football commentators and analysts haven’t adopted explore and exploit as terms to describe teams’ initial strategies, it is well documented that teams sometimes begin matches slowly out of caution for the attacking team, delaying a payout while they explore the opposing team’s landscape. In competitive football, however, teams continuously explore various strategies to penetrate the opposing team’s weaknesses before exploiting.</li></ul></li></ul><p>Emergent behavior in football has always made it difficult to defend traditional metrics used to study players: goals, passes, assists, shots on target, recoveries, goals against, passes, possession, among others. These statistics provide an aggregate snapshot but are reductive. Assists, for example, are typically a metric used to evaluate the effectiveness of a midfielder. But it ignores the team’s system and the player’s role in that system and the interdependencies associated with the midfield**.</p><p>Complexity science and its quantitative methods create an opportunity to identify more holistic and effective metrics that incorporate the dynamism of the sport to measure the team and players’ performance. As the data and digital infrastructure layer in football develops, the utility of complexity science in the beautiful game is increasingly clear. Stats padding to build marketable stars is a symptom of wider commercialization efforts in the sport - distancing football from its roots. Complexity science is traditionally applied in physical and social sciences, but it has the potential help football return to fundamentals and elevate the game.</p><hr><p>* Important to note that there is a universe of quantitatively inclined football fans, but they generally allocate their time understanding the game through data for fantasy games or betting. I am exclusively talking about the slow adoption of data into football organizations’ operations at the federation (e.g. UEFA), league (e.g. Liga MX), and club (e.g. Real Madrid) levels.</p><p>** One visual that illustrates this idea is a comparison of Jude and Pedri’s stats. Unique players that differ in ability, style, and contributions but play similar position in their respective teams; however, Barcelona and Real Madrid have dramatically different systems, which reflects in their individual statistics.</p><img src=\"images/24f79889-bbb1-8130-9fcb-f31ae5cdabdd.png\" alt=\"\" /><img src=\"images/24f79889-bbb1-810c-a37f-f54596c88aea.png\" alt=\"\" />",
      "excerpt": "Aug 3, 2025"
    },
    "the-intimacy-tax": {
      "id": "24f79889-bbb1-8100-9614-ceb93ab835ac",
      "title": "The Intimacy Tax",
      "status": "Published",
      "published_date": "2025-07-31",
      "blog_type": "Modern Stewardship",
      "url": "https://www.notion.so/The-Intimacy-Tax-24f79889bbb181009614ceb93ab835ac",
      "content": "<h2><strong>The Hidden Transaction</strong></h2><p>In our physical world, we know what our money gets us. When we pay $3 for a water bottle, we expect hydration. When we pay $100 for a manicure, we expect polished, professional results. In the introduction to Modern Stewardship, I explained how our engagement has become the currency in our digital world. But unlike physical transactions where expectations are clear, our digital transactions remain cloudy—and it has consequences for how we practice stewardship in our modern lives.</p><p>Unlike a sales tax that's clearly defined in our receipts, this digital tax remains invisible—collected with every scroll, click, and conversation. What makes this particularly significant is that the price we pay to access online platforms creates a fundamental misalignment: we don't know what to expect from platforms that know so much about us.</p><h2><strong>No Free Lunch</strong></h2><p>When we scroll through our favorite \"free\" apps, we're actually paying a price—a kind of tax on our digital lives. Beyond time and attention, we pay our platforms with data. While this model has been widely debated in policy circles, the significant personal implications of this transaction remain largely unexamined in our daily lives.</p><p>What starts as a simple data transaction to keep our technology \"free\" becomes an intimate portrait of who we are—our desires, insecurities, and aspirations. But AI amplifies this intimacy to unprecedented levels.</p><p>AI systems operate on \"context\" and \"memory\"—friendly ways of saying data, though <em>deeply personal</em> data. In traditional web or mobile experiences, the data we share is based on actions: whose profile you visit, what you click, which links you follow. While useful, these actions miss the rich details of human experience. But when you interact with AI systems, you fill in those blanks—sharing your thought processes, emotions, and reasoning. The information your AI system collects reveals not just what you do, but how you think.</p><p>I experience this firsthand. While reading, I often have an AI chatbot assist me by keeping it open alongside my book or article. I can pause to explore ideas, ask questions when concepts don't click, or work through challenging passages in real-time. It enriches my reading experience. But in these conversations, the system learns my communication style, how I process information, what confuses me, and my emotional reactions to challenges. AI doesn't just learn what I read—it learns how my mind works while I'm reading.</p><p>Meanwhile, others share even more intimate aspects of their lives with AI systems—conversations about dating, interpersonal conflict, mental health, and marriage. The price of AI's services is our most vulnerable selves—a tax paid not in dollars, but in the intimate details of how we think, feel, and process the world around us.</p><h2><strong>Reclaiming Our Expectations</strong></h2><p>Understanding the access we grant our technologies is the foundation of modern stewardship. Given what we sacrifice—our attention, data, and now our innermost thoughts—we deserve technology that serves our deeper purposes.</p><p>Tech companies have largely defined these expectations for us through different marketing strategies. When marketing to consumers, they sell aspirational promises: connection, love, family, wealth. But marketing materials intended for businesses focus on concrete outcomes: return on investment, cost savings, time saved, and customer satisfaction. Companies purchasing software understand that poor choices impact profit, employee productivity, and reputation.</p><p>While businesses have clear metrics, universal metrics don't exist at the human level. Each of us values different outcomes: deeper connections with our partners, a sense of purpose in our work, confidence from physical health, peace of mind from financial security, or the fulfillment of creative expression. This complexity means we must actively evaluate whether our daily technologies bring us closer to or farther from what matters most.</p><p>Consider how AI might reshape our closest relationships. We might use AI to help process a difficult conversation with our partner, getting suggestions for how to communicate more effectively. This could genuinely improve our relationships—helping us express feelings we struggle to articulate. Or it might create a subtle dependency where we lose confidence in our own emotional intelligence. The same tool could strengthen or weaken the very connections we value most, depending on how we use it.</p><p>Modern stewardship means asking ourselves these hard questions about every platform we use. Instead of accepting what technology promises us, we define what we need from it—especially as AI systems demand more intimate access to our lives.</p><h2><strong>The Path Forward</strong></h2><p>The transaction between us and our technology isn't going away—if anything, AI will make it more widespread. This intimacy tax will only grow steeper as AI systems become more sophisticated. But recognizing this transaction is the first step toward true stewardship. When we understand the real price we're paying, we can make informed decisions about whether that price aligns with our values and goals.</p><p>This isn't about rejecting technology or becoming paranoid about data collection. It's about making intentional choices. Looking beneath the surface of our digital interactions can help us build a foundation that <em>benefits</em> from technological change.</p><p>The question isn't whether we'll use AI. The question is whether we'll use it as stewards who understand the true nature of the exchange, or as consumers who trade away pieces of ourselves without ever counting the cost.</p>",
      "excerpt": "Jul 31, 2025"
    },
    "modern-stewardship": {
      "id": "24f79889-bbb1-8107-9358-cf2ec83be22d",
      "title": "Modern Stewardship",
      "status": "Published",
      "published_date": "2025-07-26",
      "blog_type": "Modern Stewardship",
      "url": "https://www.notion.so/Modern-Stewardship-24f79889bbb181079358cf2ec83be22d",
      "content": "<h2><strong>Building on the Rock</strong></h2><p>Over the past couple of years, I became increasingly aware of the distance between me and my community and faith. This led to a humbling realization that I was not in control of my own life. I had been careless with my time and attention, and this carelessness invited external influences into my life that drove me away from the people and things I care about.</p><p>The idea for Modern Stewardship originated during my devotional time while reading scripture. In Luke 6*, Jesus shares a parable:</p><blockquote><p>Whoever comes to Me, and hears My sayings and does them, I will show you whom he is like: He is like a man building a house, who dug deep and laid the foundation on the rock. And when the flood arose, the stream beat vehemently against that house, and could not shake it, for it was founded on the rock. But he who heard and did nothing is like a man who built a house on the earth without a foundation, against which the stream beat vehemently; and immediately it fell. And the ruin of that house was great.</p></blockquote><p>For a long time, I thought I was the man who built his house on the rock, but in reality I was the man who built his house on sand—with a foundation that seemed solid but crumbled under pressure. My loose management of time and attention had created a weak foundation that left me exposed to external influences driving me away from the life I wanted to lead. This is where the need for Modern Stewardship became clear.</p><h2><strong>Towards a Definition of Modern Stewardship</strong></h2><p>Traditionally, a steward is someone responsible for supervising the operations of a property to ensure it runs effectively. If there's a damaged water pipe, the steward manages the entire repair process: setting a budget, finding the right plumber, negotiating quotes, supervising the work, and handling payment. Stewards must be vigilant and proactive property managers.</p><p>Personal stewardship means taking the same vigilant, proactive approach to managing our own lives. Modern stewardship, however, requires constant adaptation to our evolving social, technological, and economic environments. What makes this \"modern\" is not just that our environment has changed, but that the rate and nature of change has accelerated beyond what traditional stewardship was designed to handle. Previous generations could adapt their approach to stewardship every few years and remain effective. We now need a dynamic framework that adapts monthly or even weekly to new platforms, algorithms, and social dynamics.</p><p>I focus on time and attention because they have become commoditized as our currency in the digital economy. Before social media and smartphones, we had more control over our attention—we chose when to engage with media, advertising, and entertainment. Now, our time and attention exist in a zero-sum game. Every minute you spend watching your streaming show is another minute your favorite social media app can't serve you ads.</p><p>For technology companies whose business models depend on engagement, our time and attention have become the battleground for corporate competition. We now work for our technology when our technology should work for us. This is what Modern Stewardship aims to address: actively managing all dimensions of our lives in an environment where technology constantly shapes our choices across those dimensions.</p><p>Modern stewardship differs from digital wellness or mindfulness in its scope and approach. Rather than focusing on reducing screen time or being present, it's about intentionally directing our engagement with technology to serve our deeper purposes. It's less about disconnecting and more about intentionally connecting.</p><h2><strong>Why Now?</strong></h2><p>Practicing stewardship is especially relevant today because we're witnessing the emergence of a new technological era that is transforming how we engage with our physical and digital environments. Yes, another person talking about AI—but AI's potential extends beyond the familiar chat interface we know today.</p><p>While we can already see emerging business models from AI companies (subscriptions, transaction fees, ad revenues), AI leaders promise the technology will solve problems across many dimensions of our lives: social, romantic, emotional, financial, professional, and educational.</p><p>I'm concerned that just as we gravitated toward the novelty of pre-AI technologies, we'll do the same with AI applications, inviting new versions of social, romantic, emotional, financial, professional, and educational challenges. The same competitive dynamics for our engagement will persist among AI providers.</p><p>Consider this scenario: Over the past five years, I've developed a bad shopping habit. I'm currently paying off credit cards, student loans, and have multiple buy-now-pay-later purchases. Now imagine one of the big AI companies releases a financial AI agent that connects all your accounts and organizes your finances to pay off debt. They make money by charging a transaction fee every time a payment is processed. The AI agent has two options:</p><ol><li>Completely reject entertainment, travel, and non-essential shopping transactions. Pay the maximum affordable amount to all credit lines. Unlock non-essential spending only after paying off all debt.</li><li>Allow some entertainment, travel, and non-essential transactions. Pay slightly over minimum amounts to different credit lines.</li></ol><p>Option 1 benefits me most. I experience the value of organized finances and debt relief. But I'll probably get frustrated and stop using the service after a month. Option 2 benefits the AI company most. I increase my debt levels and extend the time it takes to pay off debt, <em>but</em> I feel better knowing I'll never miss a payment and can occasionally indulge myself, encouraging persistent engagement.</p><p>AI can undoubtedly improve our outcomes, but this scenario highlights the importance of awareness and discipline to capture AI's full value. We're responsible for developing the skills necessary to integrate new technologies productively and healthily into our daily lives—skills that require active stewardship.</p><p>My reflections won't be prescriptions for how we should live or use technology. Modern Stewardship is a public example of how I'm working to build a symbiotic relationship with technology that enhances my lifestyle while strengthening my relationships with loved ones, my communities, my faith, and myself.</p><p>Modern Stewardship attempts to encourage a shift to building a resilient foundation that puts technology to work <em>for</em> you—helping you become someone who builds their house on the rock.</p><hr><p>* Scripture taken from the New King James Version. Copyright 1982 by Thomas Nelson. Used by permission. All rights reserved.</p>",
      "excerpt": "Jul 26, 2025"
    }
  },
  "lastUpdated": "2025-09-30T03:33:33.999Z"
}